app/controllers/messages_controller.rb

  	def create
		if request.content_type =~ /xml/
      message_hash = Hash.from_xml(request.body.read)

      params[:message] = {"content" => message_hash["message"]}

      @message = Message.create({text: params[:message]})
---
INSERT INTO "messages" ("text", "created_at", "updated_at") VALUES (?, ?, ?)  [["text", "rrr"], ["created_at", "2017-10-29 21:48:42.230711"], ["updated_at", "2017-10-29 21:48:42.230711"]]